---
kind: other
id: Methods.T:Autodesk.Revit.DB.FailureDefinitionAccessor
source: html/edd41ef6-cc56-ff27-317b-99d7cc9fc3ac.htm
---
# FailureDefinitionAccessor Methods

Retrieves a list of resolution types applicable to the failure.